read_verilog priority_encoder_4x2.v 
read_liberty -lib /home/ajinkya/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
hierarchy -check -top encoder

